using System;

namespace DZ_3_VvedenieSharp
{
    class Program
    {//«Морской бой» — вывести на экран массив 10х10, состоящий из символов X и O, где Х — элементы кораблей, а О — свободные клетки.
        static void Main(string[] args)
        {
            Char[,] woterWar = new char[,]{
                {'0', 'x', '0', '0', '0', 'x', 'x', 'x', 'x', 'x' },
                {'0', 'x', '0', '0', '0', '0', '0', '0', '0', '0' },
                {'0', 'x', '0', 'x', '0', '0', '0', '0', '0', 'x' },
                {'0', 'x', '0', '0', '0', 'x', 'x', '0', '0', 'x' },
                {'0', '0', '0', '0', '0', '0', '0', '0', '0', '0' },
                {'x', '0', 'x', 'x', 'x', '0', '0', '0', 'x', '0' },
                {'0', '0', '0', '0', '0', '0', 'x', '0', 'x', '0' },
                {'0', '0', '0', '0', '0', '0', '0', '0', 'x', '0' },
                {'x', 'x', '0', '0', '0', 'x', '0', '0', '0', '0' },
                {'0', '0', '0', '0', '0', 'x', '0', '0', '0', 'x' }                
                };


                for (int i = 0; i < woterWar.GetLength(0); i++)
            {
                for (int j = 0; j < woterWar.GetLength(1); j++)
                {
                    Console.Write(woterWar[i, j] + "  ");
                }
                Console.WriteLine();
            }
            
        }
    }
}
